docs/test-results/phase1/unit5-raw/A-vus30-k6.log
time="2026-08-11T14:29:51Z" level=warning msg="There were unknown fields in the options exported in the script" error="json: unknown field \"maxDuration\""

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/01-concurrent-connections.js
        output: Prometheus remote write (http://prometheus:9090/api/v1/write)

     scenarios: (100.00%) 1 scenario, 30 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 30 iterations shared among 30 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 30 VUs  00m01.0s/10m0s  00/30 shared iters

running (00m02.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 30 VUs  00m02.0s/10m0s  00/30 shared iters

running (00m03.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 30 VUs  00m03.0s/10m0s  00/30 shared iters

running (00m04.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 30 VUs  00m04.0s/10m0s  00/30 shared iters

running (00m05.0s), 20/30 VUs, 10 complete and 0 interrupted iterations
default   [  33% ] 30 VUs  00m05.0s/10m0s  10/30 shared iters

running (00m06.0s), 20/30 VUs, 10 complete and 0 interrupted iterations
default   [  33% ] 30 VUs  00m06.0s/10m0s  10/30 shared iters

running (00m07.0s), 20/30 VUs, 10 complete and 0 interrupted iterations
default   [  33% ] 30 VUs  00m07.0s/10m0s  10/30 shared iters

running (00m08.0s), 20/30 VUs, 10 complete and 0 interrupted iterations
default   [  33% ] 30 VUs  00m08.0s/10m0s  10/30 shared iters

running (00m09.0s), 20/30 VUs, 10 complete and 0 interrupted iterations
default   [  33% ] 30 VUs  00m09.0s/10m0s  10/30 shared iters

running (00m10.0s), 10/30 VUs, 20 complete and 0 interrupted iterations
default   [  67% ] 30 VUs  00m10.0s/10m0s  20/30 shared iters

running (00m11.0s), 10/30 VUs, 20 complete and 0 interrupted iterations
default   [  67% ] 30 VUs  00m11.0s/10m0s  20/30 shared iters

running (00m12.0s), 10/30 VUs, 20 complete and 0 interrupted iterations
default   [  67% ] 30 VUs  00m12.0s/10m0s  20/30 shared iters

running (00m13.0s), 10/30 VUs, 20 complete and 0 interrupted iterations
default   [  67% ] 30 VUs  00m13.0s/10m0s  20/30 shared iters

running (00m14.0s), 10/30 VUs, 20 complete and 0 interrupted iterations
default   [  67% ] 30 VUs  00m14.0s/10m0s  20/30 shared iters


  █ TOTAL RESULTS 

    CUSTOM
    client_events_received_total.....: 630    42.79504/s
    client_stream_completed_total....: 30     2.037859/s
    client_stream_duration_seconds...: p(50)=9.8505 p(95)=14.72  p(99)=14.72071 min=4.977 max=14.721
    client_ttfc_seconds..............: p(50)=5.9845 p(95)=10.857 p(99)=10.857   min=1.101 max=10.857
    sse_event........................: 630    42.79504/s

    HTTP
    http_req_duration................: p(50)=9.85s  p(95)=14.72s p(99)=14.72s   min=4.97s max=14.72s
    http_reqs........................: 30     2.037859/s

    EXECUTION
    iteration_duration...............: p(50)=9.85s  p(95)=14.72s p(99)=14.72s   min=4.97s max=14.72s
    iterations.......................: 30     2.037859/s
    vus..............................: 10     min=10     max=30
    vus_max..........................: 30     min=30     max=30

    NETWORK
    data_received....................: 81 kB  5.5 kB/s
    data_sent........................: 8.0 kB 542 B/s



running (00m14.7s), 00/30 VUs, 30 complete and 0 interrupted iterations
default ✓ [ 100% ] 30 VUs  00m14.7s/10m0s  30/30 shared iters